# =============================================================================
# Brewfile — Layer 0: system packages, GUI apps, fonts
# Machine type: {{ .machine_type }}
# Dev runtimes and CLI tools live in mise (~/.config/mise/config.toml)
# =============================================================================

# --- Taps -------------------------------------------------------------------
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
{{ if eq .machine_type "work" -}}
tap "ankitpokhrel/jira-cli"
tap "hashicorp/tap"
tap "radiusmethod/awsd"
tap "theurichde/go-aws-sso"
{{ end -}}

# --- Shells ------------------------------------------------------------------
brew "bash"
brew "elvish"
brew "fish"
brew "fisher"
brew "zsh"
{{ if ne .machine_type "casual" -}}
brew "nushell"
{{ end -}}

# --- Core system tools (can't come from mise) --------------------------------
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "grep"

# --- Build dependencies & native libs ----------------------------------------
{{ if ne .machine_type "casual" -}}
brew "autoconf"
brew "automake"
brew "enchant"
brew "libgccjit"
brew "pkgconf"
{{ end -}}
brew "ffmpeg"
brew "imagemagick"
brew "numpy"
brew "poppler"

# --- CLI tools (brew-only or need native integration) ------------------------
brew "choose"
brew "delta"
brew "eza"
brew "fd"
brew "gh"
brew "go-jsonnet"
brew "yarn"
brew "m-cli"
brew "mise"
brew "pandoc"
brew "tmux"
brew "carapace"
brew "tree"
brew "watch"
{{ if ne .machine_type "casual" -}}
brew "argc"
brew "fselect"
brew "navi"
brew "parallel"
brew "socat"
{{ end -}}
{{ if eq .machine_type "work" -}}
brew "jira-cli"
brew "radiusmethod/awsd/awsd"
{{ end -}}

# --- Desktop environment ----------------------------------------------------
cask "d12frosted/emacs-plus/emacs-plus-app"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# --- GUI apps (casks) --------------------------------------------------------
# All machines
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "ghostty"
cask "obsidian"
cask "spotify"
cask "zed"

{{ if ne .machine_type "casual" -}}
# Dev + work
cask "visual-studio-code"
{{ end -}}

{{ if eq .machine_type "work" -}}
# Work only
cask "microsoft-edge"
cask "session-manager-plugin"
cask "redis-insight"
{{ end -}}

{{ if ne .machine_type "casual" -}}
# Dev + work extras
cask "raindropio"
{{ end -}}

# --- Fonts -------------------------------------------------------------------
cask "font-aporetic"
cask "font-atkinson-hyperlegible"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-caskaydia-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"

# --- VS Code extensions ------------------------------------------------------
{{ if ne .machine_type "casual" -}}
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "mthierman.theme-flexoki"
{{ end -}}
